---
title: "Untitled"
author: "Dongkeoon Oh"
date: "2018년 9월 12일"
output: word_document
---

```{r setup, include=FALSE}
knitr::opts_chunk$set(echo = TRUE)
```

### **chapter 3**

#### 1. 


TV는 다른 설명 변수들이 서로 독립이고 값이 고정되어 있을 때, sales와 유의미한 상관관계(0.046)가 있다. (신문은 그 반대) <br>

#### 2. 

2-1 k-NN 분류에서 출력은 소속된 항목이다. 객체는 k개의 최근접 이웃 사이에서 가장 공통적인 항목에 할당되는 객체로 과반수 의결에 의해 분류된다(k는 양의 정수이며 통상적으로 작은 수). 만약 k = 1 이라면 객체는 단순히 하나의 최근접 이웃의 항목에 할당된다. <br>
2-2 k-NN 회귀에서 출력은 객체의 특성 값이다. 이 값은 k개의 최근접 이웃이 가진 값의 평균이다.<br>

#### 3.

a. ii: 성별 회귀계수가 35로 양수이고 0값이 남성이기 때문에, 여성일 때 평균 수입이 많다. <br>
상호작용항의 해석?? <br>

b. (50 + 2200 + 35 + 4.4 - 40 ) 원

c. 회귀 계수의 값이 작다는 것은 상호작용 효과가 없다는 증거가 될 수 없다. 회귀계수의 T통계량의 p-value를 통해 
회귀계수의 유의성을 검증할 수 있다. 상호작용의 효과가 없다는 것이 아니라 효과가 작다는 것이 유의미한 지, 유의미 하지 않은지를 따져야한다. 

4. 
a. 삼차회귀가 훈련 RSS가 더 낮다. 모델의 유연성이 높을 수록 데이터에 더욱 잘 적합하기 때문에 오차는 더 낮아진다.
b. 선형회귀가 검정 RSS가 더 낮다. 실제 모델이 선형이기 때문에 선형모델의 검정 오차가 더 낮다. 
c. 삼차회귀가 훈련 RSS가 더 낮다. 훈련 RSS는 모델이 유연할 수 록 데이터를 더욱 잘 적합하기 때문에 훈련 RSS는 단조 감소한다. 
d. 검정 RSS는 실제 모델이 어떤 지에 따라서 달라질 수 있따. 분산,편향 절충을 통해 적절한 유연성 수준을 찾아야 한다. 

5.   